[
  {
    "training_type": "degree",
    "link": "https://www.coursera.org/degrees/bachelor-of-science-computer-science-london",
    "title": "Bachelor of Computer Science",
    "tagline": "Earn a University of London degree in Computer Science and apply your creativity to in-demand technology.",
    "description": "Earn a University of London degree in Computer Science and apply your creativity to in-demand technology.Open the door to sought-after technology careers with a world-class online Bachelor of Science (BSc) in Computer Science degree from the University of London. You’ll master in-demand computing skills, solve complex problems, and hone your innovation and creativity. The hands-on project-based approach will help develop the technical and transferable skills needed for a fulfilling career in your field.Specialise in 1 of 7 cutting edge topics. Choose from the following areas of focus: Machine Learning and AI, Data Science, Web and Mobile Development, Physical Computing and the Internet of Things, Games Development, Virtual Reality, or User Experience.Create a portfolio of work that furthers your career. Develop skills in computing with a strong programming and mathematics focus, plus project management, presentation skills and teamwork. Create a portfolio of coursework  to present to potential or existing employers.Build technical and transferable skills needed for a career in high-growth industries. The course material ranges from entry-level subjects to specialised topics.  Hold a degree outside of computer science? The curriculum allows you to update your marketable and competitive skills through commercial applications of computing practices. The flexible degree programmes are designed for busy schedules. You can study online at your own pace.Earn a degree from a university with global reputation. The University of London, established by Royal Charter in 1836, is a globally recognised learning institution. UoL currently has over 120,000 students in London, and a further 50,000 studying abroad in 180 countries.",
    "feature_at_a_glance": "Tuition£10,592 - £15,889*Depending upon geographic locationProgram length3 - 6 years14 to 28 hours per weekBrief overview23 modulesMethod of studyOnline Courses",
    "deadline_info": "The programme is offered twice per year in April and October.The next cohort starts on October 12th, 2020; applications are now closed.Application deadline: September 7th, 2020.If you have a question please contact the University of London via their Student Enquiry System.View the Prospectus and Programme Specification.",
    "programAudience": "Who is this degree for:The University of London Bachelor of Science in Computer Science degrees offer advanced instruction in computer science fundamentals.Whether you have high school qualifications or you’re already working in a computer science field, you can earn a valuable degree that will help move your career forward.The course material ranges from entry-level subjects to specialised topics. If you already have a degree outside of computer science, the curriculum will give you the chance to stay up-to-date and learn commercial applications of computing practices.The flexible degree programmes are designed to fit around work, family, and other commitments in your life. You can study online according to your own schedule.Cohorts and Deadlines:The programme is offered twice per year in April and October.The next cohort starts on October 12th, 2020 and applications are now closed.Applications deadline: September 7th, 2020.",
    "applicationProcess": "Who is this degree for:The University of London Bachelor of Science in Computer Science degrees offer advanced instruction in computer science fundamentals.Whether you have high school qualifications or you’re already working in a computer science field, you can earn a valuable degree that will help move your career forward.The course material ranges from entry-level subjects to specialised topics. If you already have a degree outside of computer science, the curriculum will give you the chance to stay up-to-date and learn commercial applications of computing practices.The flexible degree programmes are designed to fit around work, family, and other commitments in your life. You can study online according to your own schedule.Cohorts and Deadlines:The programme is offered twice per year in April and October.The next cohort starts on October 12th, 2020 and applications are now closed.Applications deadline: September 7th, 2020.",
    "FinancialSection": "TuitionThe total cost of the programme for 2020/21 is between £10,592 - £15,889 *, depending upon geographic location. \nYou won’t be billed upfront for the whole degree. Instead, pay as you go - each time you take a module, you’ll pay the tuition just for that module. If you need to take a term off, you won’t be charged during that term.*Indicative totals are for web supported learners only reflecting average annual fee increases,  assuming students complete the qualification within the minimum time without resits and Accreditation of Prior Learning (requiring additional fees). Examination centre fees count as an additional cost. For further details please refer to the University of London website. Goods and Services Tax (GST)\nPlease note: all student fees shown are net of any local VAT, Goods and Services Tax (GST) or any other sales tax payable by the student in their country of residence. Where the University is required to add VAT, GST or any other sales tax at the local statutory rate, this will be added to the fees shown during the payment process. For students resident in the UK, our fees are exempt from VAT.Financial AidInformation on potential sources of funding and scholarships is updated annually and where available. Information is included in the programme web pages. Click here for more information.Tuition Reimbursement: Students are encouraged to seek tuition reimbursement through their employer. We recommend that you speak with your manager or HR department to see what’s available to you as an employee.We are not recognised for the GI Bill, FAFSA and Sallie Mae loans funding. This is due to the flexible nature of our degrees (distance/online learning) and the reporting criteria that these institutions use.  To learn more about financing your degree, visit the Degrees Financial Resources Hub.",
    "curriculum": "CurriculumThe BSc Computer Science degrees, developed by the team at Goldsmiths, University of London, are designed to give you a strong foundation in Computer Science and specialised knowledge of topics such as Data Science, Artificial Intelligence, Virtual Reality and Web Development. The programme covers industry and academic case studies to help you apply studies in terms of real-world problems. You’ll develop and execute a series of projects throughout the programme to develop technical skills and hone problem solving abilities.The programmes are structured into three levels. The first level covering computer programming, with a special project on web applications. You will learn how computers work as well as the mathematics that underpin computer science. The second level deepens your programming skills and your understanding of how to develop substantial software projects. You’ll also begin to learn specialised topics such as Graphics Programming and Data Science. In the third level, you’ll have the opportunity to study specialised modules depending on your specialist pathway and bring your knowledge and skills together with a final individual project — developing your own software. With a BSc Computer Science degree you’ll be qualified to:Build and maintain reliable software to address  the sophisticated demands of today's marketDevelop innovative and creative approaches to problem solvingWork independently with confidenceCompete for roles at the cutting-edge of the tech sector, including application programmer, mobile app developer, web developer, video game developer, SFX and post-production, and systems analystTo gain a BSc in Computer Science, you’ll need to complete modules worth 360 credits.\nThis includes: 8 compulsory modules at level 4, covering the fundamentals: how computers work, how to programme, and mathematics that underpin computer science.8 compulsory modules at level 5, covering programming skills needed for software projects and specialist topics such as Graphics Programming and Data Science.6 elective modules from level 6, then undertake a 30 credit project that combines your knowledge and skills to create a software system.Complete a Final project.All of the Level 4 and Level 5 modules are compulsory. There is a broad range of elective options at Level 6.Level 4 - compulsoryIntroduction to programming IIntroduction to programming IIComputational mathematicsDiscrete mathematicsHow computers workFundamentals of computer scienceWeb developmentAlgorithms and data structures ILevel 5 - compulsoryObject oriented programmingSoftware design and developmentDatabases, networks and the webAgile software projectsComputer securityGraphics programmingAlgorithms and data structures IIProgramming with dataLevel 6 - Choose 6 of the following modulesData scienceDatabases and advanced data techniquesMachine learning and neural networksArtificial intelligenceVirtual realityGames developmentAdvanced web developmentPhysical computing and the internet of things3D Graphics and animationMobile developmentInteraction designNatural language processingIntelligent signal processingMore information about each module here.You can choose to register on a specialist award to focus your studies on a particular area of Computer Science. The specialist awards are:BSc Computer Science (Machine Learning and AI)BSc Computer Science (Data Science)BSc Computer Science (Web and Mobile Development)BSc Computer Science (Physical Computing and the Internet of Things)BSc Computer Science (Games Development)BSc Computer Science (Virtual Reality)BSc Computer Science (User Experience)Try a CourseThe University of London offers a number of online taster courses and Massive Open Online Courses (MOOCs), designed to introduce themes that are included in degree programmes. The University is running three open courses that explore topics covered in the BSc Computer Science degrees.Introduction to Computer Programming\nThis course provides the foundational skillset required to write computer programs. You’ll learn how to write interactive, graphical programs from an introductory level in a real programming language. The course uses the Javascript language and the p5.js.library.How Computers Work\nThis course is designed for people who use computers, smartphones and the internet regularly and want to understand more about how they work. It is for beginners in computer science and people  interested in a more formal study of computer science. This course covers fundamental concepts that can be applied to any software or computer system, and how to apply concepts to solve everyday problems.Mathematics for Computer Science\nThis course covers the mathematical foundations needed to work in computer science in any of its strands, from business to visual digital arts, music, games. At any stage of the problem solving and modelling stage you will need proper numerical and computational tools.  Learn binary and other number bases, tools to understand sequences of numbers, how to represent space numerical using coordinates, and study variations of quantities via functions and their graphs. Solve computing and everyday life problems using these tools, from sending secret messages to designing computer graphics.If you would like a certificate of completion, you will need to submit a full payment to Coursera.\n ",
    "programLength": "Programme LengthThe BSc, via the Direct Entry Route, can be completed in three to six years, depending on module availability.Students entering via Performance Based Admissions will have a maximum of three years to complete the two modules required for admission to the full programme. The six year registration period will begin at the time of registration to the full BSc.This is a flexible programme, allowing students to study at their own pace (either part-time or full-time), adjusting the intensity of the learning to suit individual needs. There are 2 sessions in the academic year with modules starting in either October or AprilSample Schedule3 Years (28 hours per week)Autumn (October)4 modulesSpring (April)4 modulesAutumn (October)4 modulesSpring (April)4 modulesAutumn (October)4 modulesSpring (April)2 modules + Project• Over a 22 week session, a 15 credit module will typically require 150 hours of notional study hours. Each module, excluding the final project, is organised into 10 topics, with approximately 10-12 hours of study required per topic. The remaining study time is intended for coursework and examination preparation. This will roughly equate to 7 hours of study per module per week.• There are 2 sessions in the academic year with modules starting in either October or April• Students complete the programme in 3-6 years ",
    "programFlexibility": "FlexibilityFully online: The flexible degree programmes are designed to fit students’ personal schedules, allowing you to study online at your own pace. Option for local teaching support: Our programmes are designed to be studied independently with online support from the University of London, with the option to also attend classes in-person. Simply enroll at one of our approved local Recognised Teaching Centres around the world. Learn more.Option to transfer to campus: Goldsmiths, University of London welcomes applications from students who wish to transfer to an on-campus degree.To complete your degree in two years of full-time study at Goldsmiths, finish eight Level 4 modules successfully. To complete your degree in one year of full-time study at Goldsmiths, you must also have completed eight modules at Level 5.If you are interested in transferring to Goldsmiths and have successfully completed the required modules (or expect to do so in your intended year of transfer), please contact the Computing Team.",
    "programBenefitsOverview": "Student ExperienceStudy materialsOnce registered, access a range of resources and study materials on computers, tablets and other mobile devices through a Virtual Learning Environment. This learning platform is provided by Coursera, one of the world’s leading MOOC providers.Online supportReceive access to your Student Portal when you register. You can then access your University of London email account and two other key resources:The Virtual Learning Environment (VLE). Here, you can access electronic copies of all printed study materials, resources including audio-visual, and forums to discuss course material and work collaboratively with others.Access to academic support and feedback from London-based support teams. Tutors introduce the modules, respond to queries, monitor discussions and provide guidance on assessments. Utilize interactive and engaging study materials including videos, quizzes and online games to gauge your personal progress.AssessmentAssessment for this degree includes coursework, portfolios, and written exams. Your final grade for each module is based on a weighting of these assessments (e.g. 50% coursework, 50% exams). You can sit for exams at any of our approved centres worldwide.\nMore about exams.About University of London on CourseraCoursera partners with leading Universities to deliver the world’s best online degree programmes. The BSc CS programme is fully developed and taught by the same faculty that teaches on-campus at University of London. The University of London leverages Coursera’s online education platform to deliver the programme curriculum, allowing BSc CS students to benefit from Coursera features such as interactive video transcription, in-course note taking, and seamless learning across multiple devices.Degrees on Coursera are powered by technology that empowers you to learn on your schedule and device of choice. Courses consist of modules that can be completed during commutes or other short periods of spare time. Courses include supplementary readings, video lectures, assignments, and discussion forums that help spark connections with your peers.Students collaborate on group projects using Zoom and Slack, and can access instructors during live office hours. Faculty are hands-on and interactive in classes and projects.",
    "studentExperienceHighlights": "LecturesLectures are organised into weekly modules, available via video playback or interactive transcript.  Familiarize yourself with online lectures before meeting with the professor and your classmates for a deeper understanding of the material.MobileAccess your courses from anywhere — you can even download them to your mobile device and study offline wherever and whenever you choose.ForumsInteract with fellow students through course forums. Get access to every question asked and answered by previous students.",
    "career_outcome": "Career OutcomesThe BSc Computer Science helps you develop a widely applicable skill set in computing with strong programming and mathematics skills, as well as wide ranging skills in project management, effective presentations and teamwork. Graduate with a portfolio of work fit to present to potential employers. Depending on your chosen pathway, you can focus on particular areas of interest such as machine learning, web development, data science and video games.The explosive and ever-growing use of technology in business and commerce means that there's a whole range of different career possibilities for computing graduates. In terms of job opportunities and salaries, the IT sector is well ahead of most other industrial and commercial sectors.With the BSc Computer Science, you will be able to apply for a range of computational and mathematical jobs in the creative industries, business, finance, education, medicine, engineering and science. Typical job titles include:Application programmerMobile App developerWeb developerVideo game developerFilm special effects and post-productionComputer music/sound engineerInterface designerSystems analystDatabase managerI’m interested in a career in media. How will this degree work for me?“Unlike traditional degrees in music/film/media, which teach students how to use tools to manipulate media, this degree teaches you how to make your own tools for working with media. You gain a much deeper, applied technical understanding of digital media as well as having opportunities to work creatively with media.”\nDr Matthew Yee-King, Programme Director",
    "career_services": "Career ServicesThe University of London understands the importance of enhancing employability. To ensure students and graduates are standout contenders in today’s competitive job market, we offer global work-based learning opportunities within prestigious organisations and expert careers support to our students around the world. The University of London works collaboratively with The Careers Group to provide bespoke careers resources, advice and support for our global student community. Our outstanding insight and understanding of what employers are looking for in potential employees is reflected in our approach, which incorporates a blend of practical skills and self-reflective exercises, empowering students to realise their career goals.  The University of London offers a range of online resources, including video tutorials in how to write an excellent CV and perform well in interviews, and live webinars encouraging you to recognise and reflect on your capabilities. Certain programmes include the opportunity for one-to-one careers advice.Find out more about career support.\n",
    "about": "About University of LondonThe University of London has 17 independent member Institutions, of which Goldsmiths, University of London is one of them. The University of London has a long history of offering degrees via distance learning. We now offer over 100 programmes in over 180 countries.For the Bachelor of Science in Computer Science suite of degrees, Goldsmiths is providing the same academic direction and expertise provided on campus, allowing you to study this programme around the world.Creativity has always been the hallmark of Goldsmiths, University of London. Academic excellence and imaginative course content combine to make a place where creative minds thrive and ideas flourish.Goldsmiths’ courses and research activities span the arts, humanities, social sciences, cultural studies, computing, business and management across 19 academic departments.\nAcademic departments cooperate across disciplines to create exciting new courses and develop novel approaches to research issues. This interdisciplinary ethos has helped Goldsmiths to become a national leader in many subject areas.The QS World Rankings place Goldsmiths, University of London in the top five UK Universities for Art & Design and Communication & Media Studies. Goldsmiths is also in the UK’s top 25 for the quality of our research, according to the Research Excellence Framework 2014 (based on research quality scores in the Times Higher Education subject rankings).Ranked #3 in the UK in effective teaching (Guardian University League Tables 2017)Offering degree programmes at a distance since 1858Countries from which students attend: 180",
    "position": 1
  },
  {
    "link": "https://www.coursera.org/specializations/mathematics-machine-learning",
    "title": "Mathematics for Machine Learning Specialization",
    "tagline": "Mathematics for Machine Learning Specialization Mathematics for Machine Learning. Learn about the prerequisite mathematics for applications in data science and machine learning ",
    "number_star_rating": "4.4stars",
    "number_of_eval": "14,361 ratings",
    "instructor_img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-instructor-photos.s3.amazonaws.com/34/00db30ecd511e7b38865847815caeb/ICL-Materials-8_13-314-web.jpg?auto=format%2Ccompress&dpr=1&w=28&h=",
    "instructor_name": "David Dye +3 more instructors",
    "finaid": null,
    "metrics": "101,500 already enrolled",
    "skills": [
      "Eigenvalues And Eigenvectors",
      "Principal Component Analysis (PCA)",
      "Multivariable Calculus",
      "Linear Algebra",
      "Basis (Linear Algebra)",
      "Transformation Matrix",
      "Linear Regression",
      "Vector Calculus",
      "Gradient Descent",
      "Dimensionality Reduction",
      "Python Programming"
    ],
    "description": "For a lot of higher level courses in Machine Learning and Data Science, you find you need to freshen up on the basics in mathematics - stuff you may have studied before in school or university, but which was taught in another context, or not very intuitively, such that you struggle to relate it to how it’s used in Computer Science. This specialization aims to bridge that gap, getting you up to speed in the underlying mathematics, building an intuitive understanding, and relating it to Machine Learning and Data Science.In the first course on Linear Algebra we look at what linear algebra is and how it relates to data. Then we look through what vectors and matrices are and how to work with them.The second course, Multivariate Calculus, builds on this to look at how to optimize fitting functions to get good fits to data. It starts from introductory calculus and then uses the matrices and vectors from the first course to look at data fitting.The third course, Dimensionality Reduction with Principal Component Analysis, uses the mathematics from the first two courses to compress high-dimensional data. This course is of intermediate difficulty and will require Python and numpy knowledge.At the end of this specialization you will have gained the prerequisite mathematical knowledge to continue your journey and take more advanced courses in machine learning.",
    "applied_learning_project": "Applied Learning ProjectThrough the assignments of this specialisation you will use the skills you have learned to produce mini-projects with Python on interactive notebooks, an easy to learn tool which will help you apply the knowledge to real world problems. For example, using linear algebra in order to calculate the page rank of a small simulated internet, applying multivariate calculus in order to train your own neural network, performing a non-linear least squares regression to fit a model to a data set, and using principal component analysis to determine the features of the MNIST digits data set.",
    "LearnerOutcomes": "Direction SignsLearner Career Outcomes50%Started a new career after completing this specialization.",
    "ProductGlance": "Shareable CertificateShareable CertificateEarn a Certificate upon completion100% online courses100% online coursesStart instantly and learn at your own schedule.Flexible ScheduleFlexible ScheduleSet and maintain flexible deadlines.Beginner LevelBeginner LevelNo prior experience required.Hours to completeApprox. 4 months to completeSuggested 4 hours/weekAvailable languagesEnglishSubtitles: English, French, Portuguese (Brazilian), Greek, Russian, Spanish",
    "instructors": "InstructorsDavid DyeProfessor of MetallurgyDepartment of Materials219,123 Learners2 CoursesSamuel J. CooperLecturerDyson School of Design Engineering219,123 Learners2 CoursesA. Freddie PageStrategic Teaching FellowDyson School of Design Engineering219,123 Learners2 CoursesMarc Peter DeisenrothLecturer in Statistical Machine LearningDepartment of Computing49,585 Learners1 Course",
    "position": 2
  },
  {
    "link": "https://www.coursera.org/learn/data-scientists-tools",
    "title": "The Data Scientist’s Toolbox",
    "tagline": "The Data Scientist’s Toolbox",
    "number_star_rating": "4.6stars",
    "number_of_eval": null,
    "instructor_img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-instructor-photos.s3.amazonaws.com/2c/3ea105f46d1fe369e934014608ac4d/jeff-1.jpg?auto=format%2Ccompress&dpr=1&w=36&h=",
    "instructor_name": "Jeff Leek, PhD +2 more instructors",
    "finaid": null,
    "metrics": "1,536,435 recent views",
    "skills": [
      "Data Science",
      "Github",
      "R Programming",
      "Rstudio"
    ],
    "description": "In this course you will get an introduction to the main tools and ideas in the data scientist's toolbox. The course gives an overview of the data, questions, and tools that data analysts and data scientists work with. There are two components to this course. The first is a conceptual introduction to the ideas behind turning data into actionable knowledge. The second is a practical introduction to the tools that will be used in the program like version control, markdown, git, GitHub, R, and RStudio.",
    "applied_learning_project": null,
    "LearnerOutcomes": null,
    "ProductGlance": "Shareable CertificateShareable CertificateEarn a Certificate upon completion100% online100% onlineStart instantly and learn at your own schedule.Flexible deadlinesFlexible deadlinesReset deadlines in accordance to your schedule.Hours to completeApprox. 18 hours to completeAvailable languagesEnglishSubtitles: French, Korean, Russian, English, Spanish",
    "instructors": "InstructorsInstructor rating4.5/5 (2,839 Ratings)InfoJeff Leek, PhDAssociate Professor, BiostatisticsBloomberg School of Public Health 1,216,976 Learners20 CoursesRoger D. Peng, PhDAssociate Professor, BiostatisticsBloomberg School of Public Health1,198,528 Learners22 CoursesBrian Caffo, PhDProfessor, BiostatisticsBloomberg School of Public Health1,218,807 Learners21 Courses",
    "position": 3
  },
  {
    "link": "https://www.coursera.org/specializations/discrete-mathematics",
    "title": "Introduction to Discrete Mathematics for Computer Science Specialization",
    "tagline": "Introduction to Discrete Mathematics for Computer Science SpecializationBuild a Foundation for Your Career in IT. Master the math powering our lives and prepare for your software engineer or security analyst career",
    "number_star_rating": "4.6stars",
    "number_of_eval": "3,493 ratings",
    "instructor_img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-instructor-photos.s3.amazonaws.com/f2/8d54b0023c11e5829d65e86bcf7d3d/vipusktsentra.jpg?auto=format%2Ccompress&dpr=1&w=28&h=",
    "instructor_name": "Alexander S. Kulikov +2 more instructors",
    "finaid": "Financial aid available",
    "metrics": "48,726 already enrolled",
    "skills": [
      "Graph Theory",
      "Number Theory",
      "Cryptography",
      "Probability",
      "Mathematical Induction",
      "Proof Theory",
      "Discrete Mathematics",
      "Mathematical Logic",
      "Random Variable",
      "Probability Interpretations",
      "Combinatorics",
      "Modular Exponentiation"
    ],
    "description": "Discrete Mathematics is the language of Computer Science. One needs to be fluent in it to work in many fields including data science, machine learning, and software engineering (it is not a coincidence that math puzzles are often used for interviews). We introduce you to this language through a fun try-this-before-we-explain-everything approach: first you solve many interactive puzzles that are carefully designed specifically for this online specialization, and then we explain how to solve the puzzles, and introduce important ideas along the way. We believe that this way, you will get a deeper understanding and will better appreciate the beauty of the underlying ideas (not to mention the self confidence that you gain if you invent these ideas on your own!). To bring your experience closer to IT-applications, we incorporate programming examples, problems, and projects in the specialization. ",
    "applied_learning_project": "Applied Learning ProjectWe’ll implement together an efficient program for a problem needed by delivery companies all over the world millions times per day — the travelling salesman problem. The goal in this problem is to visit all the given places as quickly as possible. How to find an optimal solution to this problem quickly? We still don’t have provably efficient algorithms for this difficult computational problem and this is the essence of the P versus NP problem, the most important open question in Computer Science. Still, we’ll implement several efficient solutions for real world instances of the travelling salesman problem. While designing these solutions, we will rely heavily on the material learned in the courses of the specialization: proof techniques, combinatorics, probability, graph theory. We’ll see several examples of using discrete mathematics ideas to get more and more efficient solutions. ",
    "LearnerOutcomes": "Direction SignsLearner Career Outcomes50%Started a new career after completing this specialization.50%Got a pay increase or promotion.",
    "ProductGlance": "Shareable CertificateShareable CertificateEarn a Certificate upon completion100% online courses100% online coursesStart instantly and learn at your own schedule.Flexible ScheduleFlexible ScheduleSet and maintain flexible deadlines.Beginner LevelBeginner LevelNo prior experience required.Hours to completeApprox. 6 months to completeSuggested 5 hours/weekAvailable languagesEnglishSubtitles: English, Vietnamese, Arabic, French, Portuguese (Brazilian), Chinese (Simplified), Greek, Russian, Spanish",
    "instructors": "InstructorsAlexander S. KulikovVisiting ProfessorDepartment of Computer Science and Engineering510,831 Learners13 CoursesMichael LevinLecturerComputer Science473,960 Learners8 CoursesVladimir PodolskiiAssociate ProfessorFaculty of Computer Science115,972 Learners5 Courses",
    "position": 4
  },
  {
    "link": "https://www.coursera.org/learn/crypto",
    "title": "Cryptography I",
    "tagline": "Cryptography I",
    "number_star_rating": "4.8stars",
    "number_of_eval": null,
    "instructor_img": null,
    "instructor_name": null,
    "finaid": null,
    "metrics": "285,408 already enrolled",
    "skills": [
      "Cryptography",
      "Cryptographic Attacks",
      "Public-Key Cryptography",
      "Symmetric-Key Algorithm"
    ],
    "description": "Cryptography is an indispensable tool for protecting information in computer systems. In this course you will learn the inner workings of cryptographic systems and how to correctly use them in real-world applications. The course begins with a detailed discussion of how two parties who have a shared secret key can communicate securely when a powerful adversary eavesdrops and tampers with traffic. We will examine many deployed protocols and analyze mistakes in existing systems. The second half of the course discusses public-key techniques that let two parties generate a shared secret key. Throughout the course participants will be exposed to many exciting open problems in the field and work on fun (optional) programming projects. In a second course (Crypto II) we will cover more advanced cryptographic tasks such as zero-knowledge, privacy mechanisms, and other forms of encryption.SHOW ALL COURSE OUTLINESHOW ALL",
    "applied_learning_project": null,
    "LearnerOutcomes": null,
    "ProductGlance": "Shareable CertificateShareable CertificateEarn a Certificate upon completion100% online100% onlineStart instantly and learn at your own schedule.Flexible deadlinesFlexible deadlinesReset deadlines in accordance to your schedule.Hours to completeApprox. 23 hours to completeAvailable languagesEnglishSubtitles: English, Spanish, Russian, French",
    "instructors": "InstructorInstructor rating4.82/5 (165 Ratings)InfoDan BonehProfessorComputer Science298,024 Learners2 Courses",
    "position": 5
  },
  {
    "link": "https://www.coursera.org/learn/game-theory-1",
    "title": "Game Theory",
    "tagline": "Game Theory",
    "number_star_rating": "4.6stars",
    "number_of_eval": null,
    "instructor_img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-instructor-photos.s3.amazonaws.com/78/cbe70220c37d984f9a9efefa3148c7/Matthew-O.-Jackson.png?auto=format%2Ccompress&dpr=1&w=28&h=",
    "instructor_name": "Matthew O. Jackson +2 more instructors",
    "finaid": null,
    "metrics": "296,496 already enrolled",
    "skills": [
      "Game Theory",
      "Backward Induction",
      "Bayesian Game",
      "Problem Solving"
    ],
    "description": "Popularized by movies such as \"A Beautiful Mind,\" game theory is the mathematical modeling of strategic interaction among rational (and irrational) agents. Beyond what we call `games' in common language, such as chess, poker, soccer, etc., it includes the modeling of conflict among nations, political campaigns, competition among firms, and trading behavior in markets such as the NYSE. How could you begin to model keyword auctions, and peer to peer file-sharing networks, without accounting for the incentives of the people using them? The course will provide the basics: representing games and strategies, the extensive form (which computer scientists call game trees), Bayesian games (modeling things like auctions), repeated and stochastic games, and more. We'll include a variety of examples including classic games and a few applications.You can find a full syllabus and description of the course here:  http://web.stanford.edu/~jacksonm/GTOC-Syllabus.html \n\nThere is also an advanced follow-up course to this one, for people already familiar with game theory:  https://www.coursera.org/learn/gametheory2/\n\nYou can find an introductory video here:  http://web.stanford.edu/~jacksonm/Intro_Networks.mp4SHOW ALL COURSE OUTLINESHOW ALL",
    "applied_learning_project": null,
    "LearnerOutcomes": null,
    "ProductGlance": "Shareable CertificateShareable CertificateEarn a Certificate upon completion100% online100% onlineStart instantly and learn at your own schedule.Flexible deadlinesFlexible deadlinesReset deadlines in accordance to your schedule.Beginner LevelBeginner LevelHours to completeApprox. 17 hours to completeAvailable languagesEnglishSubtitles: English, Chinese (Simplified)",
    "instructors": "InstructorsInstructor rating4.5/5 (231 Ratings)InfoMatthew O. JacksonProfessorEconomics337,820 Learners3 CoursesKevin Leyton-BrownProfessorComputer Science303,124 Learners2 CoursesYoav ShohamProfessorComputer Science303,124 Learners2 Courses",
    "position": 6
  },
  {
    "link": "https://www.coursera.org/learn/linear-algebra-machine-learning",
    "title": "Mathematics for Machine Learning: Linear Algebra",
    "tagline": "Mathematics for Machine Learning: Linear Algebra",
    "number_star_rating": "4.7stars",
    "number_of_eval": null,
    "instructor_img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-instructor-photos.s3.amazonaws.com/34/00db30ecd511e7b38865847815caeb/ICL-Materials-8_13-314-web.jpg?auto=format%2Ccompress&dpr=1&w=28&h=",
    "instructor_name": "David Dye +2 more instructors",
    "finaid": "Financial aid available",
    "metrics": "205,416 already enrolled",
    "skills": [
      "Eigenvalues And Eigenvectors",
      "Basis (Linear Algebra)",
      "Transformation Matrix",
      "Linear Algebra"
    ],
    "description": "In this course on Linear Algebra we look at what linear algebra is and how it relates to vectors and matrices. Then we look through what vectors and matrices are and how to work with them, including the knotty problem of eigenvalues and eigenvectors, and how to use these to solve problems. Finally  we look at how to use these to do fun things with datasets - like how to rotate images of faces and how to extract eigenvectors to look at how the Pagerank algorithm works.Since we're aiming at data-driven applications, we'll be implementing some of these ideas in code, not just on pencil and paper. Towards the end of the course, you'll write code blocks and encounter Jupyter notebooks in Python, but don't worry, these will be quite short, focussed on the concepts, and will guide you through if you’ve not coded before.\n\nAt the end of this course you will have an intuitive understanding of vectors and matrices that will help you bridge the gap into linear algebra problems, and how to apply these concepts to machine learning.SHOW ALL COURSE OUTLINESHOW ALL",
    "applied_learning_project": null,
    "LearnerOutcomes": null,
    "ProductGlance": "Shareable CertificateShareable CertificateEarn a Certificate upon completion100% online100% onlineStart instantly and learn at your own schedule.SpecializationCourse 1 of 3 in theMathematics for Machine Learning SpecializationFlexible deadlinesFlexible deadlinesReset deadlines in accordance to your schedule.Beginner LevelBeginner LevelHours to completeApprox. 19 hours to completeAvailable languagesEnglishSubtitles: English",
    "instructors": "InstructorsInstructor rating4.75/5 (1,068 Ratings)InfoDavid DyeProfessor of MetallurgyDepartment of Materials219,123 Learners2 CoursesSamuel J. CooperLecturerDyson School of Design Engineering219,123 Learners2 CoursesA. Freddie PageStrategic Teaching FellowDyson School of Design Engineering219,123 Learners2 Courses",
    "position": 7
  },
  {
    "link": "https://www.coursera.org/learn/data-scientists-tools",
    "title": "The Data Scientist’s Toolbox",
    "tagline": "The Data Scientist’s Toolbox",
    "number_star_rating": "4.6stars",
    "number_of_eval": null,
    "instructor_img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-instructor-photos.s3.amazonaws.com/2c/3ea105f46d1fe369e934014608ac4d/jeff-1.jpg?auto=format%2Ccompress&dpr=1&w=28&h=",
    "instructor_name": "Jeff Leek, PhD +2 more instructors",
    "finaid": "Financial aid available",
    "metrics": "556,608 already enrolled",
    "skills": [
      "Data Science",
      "Github",
      "R Programming",
      "Rstudio"
    ],
    "description": "In this course you will get an introduction to the main tools and ideas in the data scientist's toolbox. The course gives an overview of the data, questions, and tools that data analysts and data scientists work with. There are two components to this course. The first is a conceptual introduction to the ideas behind turning data into actionable knowledge. The second is a practical introduction to the tools that will be used in the program like version control, markdown, git, GitHub, R, and RStudio.",
    "applied_learning_project": null,
    "LearnerOutcomes": null,
    "ProductGlance": "Shareable CertificateShareable CertificateEarn a Certificate upon completion100% online100% onlineStart instantly and learn at your own schedule.Flexible deadlinesFlexible deadlinesReset deadlines in accordance to your schedule.Hours to completeApprox. 18 hours to completeAvailable languagesEnglishSubtitles: French, Korean, Russian, English, Spanish",
    "instructors": "InstructorsInstructor rating4.5/5 (2,839 Ratings)InfoJeff Leek, PhDAssociate Professor, BiostatisticsBloomberg School of Public Health 1,216,976 Learners20 CoursesRoger D. Peng, PhDAssociate Professor, BiostatisticsBloomberg School of Public Health1,198,528 Learners22 CoursesBrian Caffo, PhDProfessor, BiostatisticsBloomberg School of Public Health1,218,807 Learners21 Courses",
    "position": 8
  }
]